tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "phrase/brewed"
tap "wtfutil/wtfutil"
tap "adoptopenjdk/openjdk"

repo = 'popcorn-official/popcorn-desktop'
tap repo, "https://github.com/#{repo}.git"

# utility/essential
cask "applite"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "gpg"
brew "hub"
brew "htop"
brew "mas"
brew "mosh"
brew "openvpn"
brew "pinentry-mac"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wtfutil"
brew "zsh"

# development dependencies
cask "adoptopenjdk8"
cask "adoptopenjdk11"
brew "nvm"
brew "postgresql", restart_service: true
brew "yarn"
brew "awscli"
brew "ant"
brew "maven"
brew "gradle"
brew "nginx"
brew "watchman"

# games and fun stuff
brew "archey"
brew "bastet"
brew "cheat"
brew "cmatrix"
brew "cowsay"
brew "figlet"
brew "fortune"
brew "greed"
brew "moon-buggy"
brew "nethack"
brew "ninvaders"
brew "nsnake"
brew "sl"
brew "wakeonlan"
brew "youtube-dl"

# native and gui apps
cask "1password"
cask "aerial"
cask "android-sdk"
cask "android-ndk"
cask "android-studio"
cask "alfred"
cask "atom"
cask "brave-browser"
cask "balenaetcher"
cask "discord"
cask "deluge"
cask "diskwave"
cask "epic-games"
cask "firefox"
cask "gimp"
cask "github"
cask "iterm2"
cask "menumeters"
cask "minecraft"
cask "mixxx"
cask "nordvpn"
cask "omnidisksweeper"
cask "openemu"
cask "opera"
cask "paintbrush"
cask "plex"
cask "pock"
cask "popcorn-time"
cask "postman"
cask "react-native-debugger"
cask "sequel-pro"
cask "simple-comic"
cask "slack"
cask "steam"
cask "spectacle"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "workflowy"

# mac app store
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.apple.dt.Xcode", id: 497799835
