tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "phrase/brewed"
tap "wtfutil/wtfutil"

# utility/essential
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "gpg"
brew "hub"
brew "htop"
brew "mas"
brew "mosh"
brew "pinentry-mac"
brew "ssh-copy-id"
brew "tree"
brew "vim"
brew "wget"
brew "wtfutil"
brew "zsh"

# development dependencies
brew "nvm"
brew "postgresql", restart_service: true
brew "yarn"
brew "awscli"
brew "ant"
brew "maven"
brew "gradle"

# games and fun stuff
brew "archey"
brew "cheat"
brew "cmatrix"
brew "cowsay"
brew "figlet"
brew "fortune"
brew "nethack"
brew "sl"
brew "wakeonlan"
brew "youtube-dl"

# native and gui apps
cask "1password"
cask "aerial"
cask "android-sdk"
cask "android-ndk"
cask "alfred"
cask "atom"
casl "brave-browser"
cask "cathode"
cask "diskwave"
cask "gimp"
cask "homebrew/cask-fonts/font-fira-code"
cask "iterm2"
cask "minecraft"
cask "mixxx"
cask "nordvpn"
cask "omnidisksweeper"
cask "openemu"
cask "opera"
cask "pock"
cask "react-native-debugger"
cask "simple-comic"
cask "slack"
cask "spectacle"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "workflowy"

# mac app store
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.apple.dt.Xcode", id: 497799835
mas "com.giorgiocalderolla.Wipr-Mac", id: 1320666476
mas "com.wireguard.macos", id: 1451685025
